АлогистикТест2/src/Documents/алк_ПересортицаНоменклатуры/алк_ПересортицаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПересортицаНоменклатуры</name>
  <basedOn>Document.алк_ПриемкаЛесопродукции</basedOn>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииНаОтветхранении</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      <types>DocumentRef.алк_ВозвратОтветхранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэфПересортицы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегистра</name>
    <type>
      <types>EnumRef.алк_ВидыРегистровИнвентаризации</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапасыРасход</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияТД</name>
      <type>
        <types>DocumentRef.рфп_ОтгрузкаВагона</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапасыПриход</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияТД</name>
      <type>
        <types>DocumentRef.рфп_ОтгрузкаВагона</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыРегистровИнвентаризации/алк_ВидыРегистровИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыРегистровИнвентаризации</name>
  <enumValues>
    <name>ЗапасыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>УчетЛесопродукцииНаОтветхранении</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>УчетЛесопродукцииГОСТ</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПересортицаНоменклатуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаЗаполнения.
	//
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
			
			Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			КонецЕсли; 
			
		Иначе
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ПриемкаЛесопродукции")] = "ЗаполнитьПоПриемкаЛесопродукции";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Документы.алк_ПересортицаНоменклатуры.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		Если ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.ЗапасыОрганизации Тогда
			РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
			
			
		ИначеЕсли ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииНаОтветхранении Тогда
			РфпСервер.ОтразитьУчетЛесопродукцииНаОтветхранении(ДополнительныеСвойства, Движения, Отказ);
			
		КонецЕсли; 
		
		//Сергеева Г.О. Оборотный регистр ++
		РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ); 
		РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ); 		
		//Сергеева Г.О. Оборотный регистр --
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
        КонецЕсли;
		// Отражение по "Последовательностям"
		РфпСервер.ОтразитьДокументыПоследовательностиБиржа(ДополнительныеСвойства, Движения, Отказ);
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		 //Отключаем контроль по новым регистрам 20241121 Данько ТА   
		 
		//Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда
		//	
		//	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение);
		//			
		//Иначе
			ОтказПоКонтролю = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизации");
			
			//Если (ОтказПоКонтролю ИЛИ ОтказПоДублям) И Не ПропускатьМинусЗапасы Тогда
			//	
			//	Отказ = Истина;
			//	
			//КонецЕсли; 
			
			Если ОтказПоКонтролю Тогда
				
				Отказ = Истина;
				
			КонецЕсли;  	
			
		//КонецЕсли;
		
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ДокументОснование) И РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		//	
		//	ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
		//	
		//	Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
		//	
		//КонецЕсли; 
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(ДокументОснование) Тогда
			
			РезультатПроверки = ПроверитьОснованиеНаДубли();
			
			Если РезультатПроверки <> Неопределено Тогда
				
				Отказ = Истина;
				
				Дубли = "";
				Для каждого стрРезультат Из РезультатПроверки Цикл
					Дубли = Дубли + ?(Дубли <> "", ", ", "") + стрРезультат.Ссылка;	
				КонецЦикла; 
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Дублируются документы в разрезе приемки (основанию)! " + Дубли;
				Сообщение.Сообщить(); 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		КоэфПересортицы = ?(ЗапасыРасход.Итог("Объем") = 0,0,Окр(ЗапасыПриход.Итог("Объем")/ЗапасыРасход.Итог("Объем"), 3));
		
	КонецПроцедуры
	
	#КонецОбласти	
	
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			
		КонецЕсли;
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	Заказ = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		
	КонецПроцедуры
	
	// Обработчик заполнения на основании данных заполнения.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура.
	//
	Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
		
		Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			
			ОнЖе = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		//
		//ПроверитьУникальностьСчетаФактуры();
		
		ЗаполнитьЗапасыПоТЧДокументыОснования();
		
	КонецПроцедуры
	
	Процедура ЗаполнитьЗапасыПоТЧДокументыОснования()
		
		ЗапасыРасход.Очистить();
		ЗапасыПриход.Очистить();
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ПриемкаЛесопродукции") Тогда
			
			ЗаполнитьПоПриемкаЛесопродукции(ДокументОснование);
			
		КонецЕсли
		
		
	КонецПроцедуры  //ЗаполнитьЗапасыПоТЧДокументыОснования()
	
	// Обработчик заполнения документа на основании Приемки лесопродукции.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоПриемкаЛесопродукции(ДанныеЗаполнения) Экспорт
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		//Организация = ДанныеЗаполнения.Организация;
		
		ДатаСмены = ДанныеЗаполнения.ДатаСмены;
		СменаУдалить     = ДанныеЗаполнения.Смена;
		
		Дата      = ДанныеЗаполнения.Дата + 1;
		
		Комментарий = "#Перевод нечетных сечений ""Оперучета"" в соответствие ГОСТу для некондиции";
		
		Для Каждого ТекСтрокаОУ Из ДанныеЗаполнения.ПиловочникОУ Цикл
			
			Если ТекСтрокаОУ.Основная ИЛИ Не ТекСтрокаОУ.Штабель.Несоответствие Тогда
				Продолжить;	
			КонецЕсли; 
			
			НоваяСтрока = ЗапасыРасход.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаОУ.Номенклатура;
			НоваяСтрока.Характеристика = ТекСтрокаОУ.Характеристика;
			НоваяСтрока.Штабель = ТекСтрокаОУ.Штабель;
			
			НоваяСтрока.Количество = ТекСтрокаОУ.Количество;
			НоваяСтрока.Объем = ТекСтрокаОУ.Объем;
			
		КонецЦикла;
		
		Для Каждого ТекСтрокаГОСТ Из ДанныеЗаполнения.ПиловочникГОСТ Цикл
			
			Если ТекСтрокаГОСТ.Основная ИЛИ Не ТекСтрокаГОСТ.Штабель.Несоответствие Тогда
				Продолжить;	
			КонецЕсли; 
			
			НоваяСтрока = ЗапасыПриход.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаГОСТ.Номенклатура;
			НоваяСтрока.Характеристика = ТекСтрокаГОСТ.Характеристика;
			НоваяСтрока.Штабель = ТекСтрокаГОСТ.Штабель;
			
			НоваяСтрока.Количество = ТекСтрокаГОСТ.Количество;
			НоваяСтрока.Объем = ТекСтрокаГОСТ.Объем;
			
		КонецЦикла;
		
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область СлужебныеПиФ
	
	Функция ПроверитьОснованиеНаДубли()
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПересортицаНоменклатуры.Ссылка
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры КАК алк_ПересортицаНоменклатуры
		|ГДЕ
		|	алк_ПересортицаНоменклатуры.Проведен
		|	И алк_ПересортицаНоменклатуры.Ссылка <> &Ссылка
		|	И алк_ПересортицаНоменклатуры.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.ДокументОснование);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Возврат РезультатЗапроса.Выгрузить();
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли; 
		
	КонецФункции // ПроверитьПартиюНаДубли()
	
	#КонецОбласти 
	
#КонецЕсли


Процедура Конец()
КонецПроцедуры
